<?php
// PHP7/HTML5, EDGE/CHROME                              *** GalleryNews.php ***

// ****************************************************************************
// * ittve.me        Развернуть новостную галлерею для редактируемой страницы *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  13.01.2019
// Copyright © 2019 tve                              Посл.изменение: 04.05.2021

$FileName="EdisiteArticle/_Current/Подъем настроения.jpg";
$Comment="Ночная прогулка по Ладоге до рассвета и подъёма настроения.";
GViewImage($FileName,$Comment);

$FileName="EdisiteArticle/_Current/С заботой и к мамам.jpg";
$Comment="'С заботой и к мамам' - такой мамочкин хвостик.";
GViewImage($FileName,$Comment);

// <!-- --> *********************************************** GalleryNews.php ***
