<?php
// PHP7/HTML5, EDGE/CHROME                              *** Reset/index.php ***

// ****************************************************************************
// * KwinFlat.ru            Инициировать страницу сброса к начальному расчету *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  14.08.2016
// Copyright © 2016 tve                              Посл.изменение: 15.04.2018

require_once $_SERVER['DOCUMENT_ROOT']."/Common.php";
\common\Headeri("/Main.php?Com=Atfirst");

// ******************************************************** Reset/index.php ***
?>
