<?php namespace common;

// PHP7/HTML5, EDGE/CHROME                                   *** Common.php ***

// ****************************************************************************
// * ittve.pw                                       Блок общесайтовых функций *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  24.02.2018
// Copyright © 2018 tve                              Посл.изменение: 06.01.2019

// ****************************************************************************
// *                 Послать заголовок с настройкой на HTTPS                  *
// ****************************************************************************
function Headeri($page)
{
    if ($_SERVER['HTTP_HOST']=='kwinflat.ru')
    {
        //echo "Location: https://".$_SERVER['HTTP_HOST'].$page;
        Header("Location: https://".$_SERVER['HTTP_HOST'].$page);
    }
    else 
    {
        //echo "Location: http://".$_SERVER['HTTP_HOST'].$page;
        Header("Location: http://".$_SERVER['HTTP_HOST'].$page);
    }
}


// ************************************************************* Common.php ***

