<?php
// PHP7/HTML5, EDGE/CHROME                                  *** ittvepw.php ***

// ****************************************************************************
// * ittve.pw                                    Блок вспомогательных функций *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  04.05.2021
// Copyright © 2021 tve                              Посл.изменение: 14.11.2022

// ************************************************************ ittvepw.php ***
