<?php
// PHP7/HTML5, EDGE/CHROME                                    *** Sitem.php ***

// ****************************************************************************
// * ittve.pw                     В мобильном программировании моё увлечение! *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  23.11.2018
// Copyright © 2018 tve                              Посл.изменение: 23.04.2021

// Устанавливаем режим работы сайта и настройки разметки 
iniSitemMode($c_SiteMode);
SiteMarkup($c_SiteMode,$SiteDevice);

// ****************************************************************************
// *           Установить режим работы сайта и настройки разметки             *
// ****************************************************************************
function iniSitemMode($SiteMode)
{
   if ($SiteMode==rzmMain)
   {
      echo '<style>'; 
      echo '
      ';
      echo'</style>';
   }
   else if ($SiteMode==rzmCompare)
   {
   } 
   else
   {
   }
   $Result=true;
   return $Result;
}

// ************************************************************** Sitem.php ***
