<?php
// PHP7/HTML5, EDGE/CHROME                                   *** fBlock.php ***

// ****************************************************************************
// * ittve.pw                                   В программировании моя жизнь! *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  23.11.2018
// Copyright © 2018 tve                              Посл.изменение: 24.02.2019

echo 'fBlock';
?>
<?php
// *** <!-- --> ************************************************ fBlock.php ***
