<?php
// PHP7/HTML5, EDGE/CHROME                                   *** nBlock.php ***

// ****************************************************************************
// * ittve.pw                                        Развернуть главное меню  *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  23.11.2018
// Copyright © 2018 tve                              Посл.изменение: 21.04.2021

echo 'hBlock';
?>
<?php
// *** <!-- --> ************************************************ nBlock.php ***
