<?php
// PHP7/HTML5, EDGE/CHROME                                   *** nBlock.php ***

// ****************************************************************************
// * ittve.pw                                        Развернуть главное меню  *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  23.11.2018
// Copyright © 2018 tve                              Посл.изменение: 22.04.2021

//echo 'hBlock';
echo '
<nav id="main-nav">
<ul id="main-menu" class="sm sm-mint">
  <li><a href="#">ММС Лада-Нива</a>
    <ul>
      <li><a href="#">С чего все началось</a></li>
      <li><a href="#">А что внутри?</a></li>
      <li><a href="#">Эксперименты со строками</a></li>
    </ul>
  </li>
  <li><a href="#">Стиль программирования</a></li>
  <li><a href="#">Структурное проектирование</a></li>
  <li><a href="#">Учебники</a></li>
  <li><a href="#">О сайте</a></li>
</ul>
</nav>
';



?>
<?php
// *** <!-- --> ************************************************ nBlock.php ***
