<?php
// PHP7/HTML5, EDGE/CHROME                                    *** lSide.php ***

// ****************************************************************************
// * ittve.pw                                   В программировании моя жизнь! *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  23.11.2018
// Copyright © 2018 tve                              Посл.изменение: 25.02.2019

?>

<p>Разум — это Будда, а прекращение умозрительного мышления — это путь. 
Перестав мыслить понятиями и размышлять о путях существования и небытия, 
о душе и плоти, о пассивном и активном и о других подобных вещах, 
начинаешь осознавать, что разум — это Будда, 
что Будда — это сущность разума, 
и что разум подобен бесконечности.</p>
         
<?php
   if ($SiteDevice<>Mobile)
   {   
      // require_once "MenuAccord.php";
   }
?>

<?php
// <!-- --> ***************************************************** lSide.php ***
