// LAZARUS WIN10\XP                                 *** LaziPrownOutfit.pas ***

// ****************************************************************************
// *                  Реестр констант набора модулей TLaziPrown               *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  21.08.2017
// Copyright © 2017 TVE                              Посл.изменение: 29.08.2017

unit LaziPrownOutfit;

{$mode objfpc}{$H+}

interface

uses
  Classes, SysUtils;

const

  // Завершаемость приложения после вывода сообщения
  noTerminate    = 0;  // "Продолжить работу после вывода сообщения"
  queryTerminate = 1;  // "Запросить указание на завершение приложения"
  yesTerminate   = 2;  // "Закрыть приложение после вывода сообщения"


implementation

end.

// **************************************************** LaziPrownOutfit.pas ***

